FranFer03/firmware-microntroladores/PSOC-5LP/Proyecto Final - Hidroponia/proyecto_integrador/lcd.cydsn/codegentemp/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "SDA_1_aliases.h"
#include "SDA_1.h"
#include "SCL_1_aliases.h"
#include "SCL_1.h"
#include "I2C.h"
#include "I2C_PVT.h"
#include "LCD_I2C_FUNCS.h"
#include "LCD_I2C_LL_I2C.h"
#include "LCD_I2C_REGS.h"
#include "DHT_aliases.h"
#include "DHT.h"
#include "Clock.h"
#include "Control.h"
#include "Timer.h"
#include "echo_aliases.h"
#include "echo.h"
#include "trigger_aliases.h"
#include "trigger.h"
#include "UART.h"
#include "isrRX.h"
#include "Bomb_aliases.h"
#include "Bomb.h"
#include "UART_IntClock.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

